uhnp/src/InformationRegisters/УстановкаЛимитовПоДаннымБюджетированияПараметрыЛимитирования/УстановкаЛимитовПоДаннымБюджетированияПараметрыЛимитирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УстановкаЛимитовПоДаннымБюджетированияПараметрыЛимитирования</name>
  <resources>
    <name>ИспользоватьЛимитирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПериодичностьЛимитирования</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </resources>
  <resources>
    <name>СпособОпределенияВалютыЛимитирования</name>
    <type>
      <types>EnumRef.СпособыОпределенияВалютыЛимитирования</types>
    </type>
  </resources>
  <resources>
    <name>ВалютаЛимитирования</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ПериодЛимитированияЗакрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.УправлениеЛимитами</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодОтчета</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЦФО</name>
    <type>
      <types>DefinedType.ЦФО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/УдалитьУстановкаЛимитовПоДаннымБюджетированияПараметрыЛимитирования/УдалитьУстановкаЛимитовПоДаннымБюджетированияПараметрыЛимитирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УдалитьУстановкаЛимитовПоДаннымБюджетированияПараметрыЛимитирования</name>
  <resources>
    <name>ИспользоватьЛимитирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПериодичностьЛимитирования</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </resources>
  <resources>
    <name>СпособОпределенияВалютыЛимитирования</name>
    <type>
      <types>EnumRef.СпособыОпределенияВалютыЛимитирования</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьПериодЛимитирования</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </resources>
  <resources>
    <name>ВалютаЛимитирования</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>ПериодЛимитированияЗакрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.УправлениеЛимитами</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидБюджета</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыБюджетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодОтчета</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЦФО</name>
    <type>
      <types>DefinedType.ЦФО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Catalogs/Периоды/Периоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Периоды</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>Произвольный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименование1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНаименование2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/InformationRegisters/УстановкаЛимитовПоДаннымБюджетированияПараметрыЛимитирования/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиОбновления

Процедура ЗаполнитьНачалоПериодаПериодичностьПоПериодуЛимитирования() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеРегистра.Документ КАК Документ,
	|	ДанныеРегистра.ВидБюджета КАК ВидБюджета,
	|	ДанныеРегистра.ПериодОтчета КАК ПериодОтчета,
	|	ДанныеРегистра.ЦФО КАК ЦФО,
	|	ДанныеРегистра.УдалитьПериодЛимитирования КАК УдалитьПериодЛимитирования,
	|	ДанныеРегистра.УдалитьПериодЛимитирования.Периодичность КАК Новый_Периодичность,
	|	ДанныеРегистра.УдалитьПериодЛимитирования.ДатаНачала КАК Новый_НачалоПериода
	|ИЗ
	|	РегистрСведений.УдалитьУстановкаЛимитовПоДаннымБюджетированияПараметрыЛимитирования КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.УдалитьПериодЛимитирования <> ЗНАЧЕНИЕ(Справочник.Периоды.ПустаяСсылка)
	|	И (ДанныеРегистра.НачалоПериода = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			ИЛИ ДанныеРегистра.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.ПустаяСсылка))";
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.УдалитьУстановкаЛимитовПоДаннымБюджетированияПараметрыЛимитирования.СоздатьНаборЗаписей();
		
		НаборЗаписей.Отбор.Документ.Установить(Выборка.Документ);
		НаборЗаписей.Отбор.ВидБюджета.Установить(Выборка.ВидБюджета);
		НаборЗаписей.Отбор.ПериодОтчета.Установить(Выборка.ПериодОтчета);
		НаборЗаписей.Отбор.ЦФО.Установить(Выборка.ЦФО);
		
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() = 1 Тогда
			Движение = НаборЗаписей[0];
			Движение.НачалоПериода = Выборка.Новый_НачалоПериода;
			Движение.Периодичность = Выборка.Новый_Периодичность;
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
